tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "twpayne/taps"
tap "iveney/mocha"

cask "java"
cask "iterm2"
cask "zoomus"
cask "visual-studio-code"
cask "pgadmin4"
cask "sloth"
cask "xmind"
cask "vlc"
cask "spectacle"
cask "firefox"

# Fonts
cask "font-meslo-for-powerline"

brew "git-ftp"
brew "gnu-sed"
brew "hugo"
brew "inetutils"
brew "ncftp"
brew "plantuml"
brew "python3"
brew "ripgrep"
brew "twpayne/taps/chezmoi"
brew "tmux"
brew "node"
# Fasd (pronounced similar to "fast") is a command-line productivity booster. https://github.com/clvv/fasd
brew "fasd"
# Simplistic interactive filtering tool https://github.com/peco/peco
brew "peco"
# Tig is an ncurses-based text-mode interface for git.
brew "tig"
# OS X: Get Full Path of File Using Realpath
brew "realpath"
brew "mackup"
# Lynx is a fully featured World-Wide Web browser for terminal users. https://invisible-island.net/lynx/
brew "lynx"
brew "colordiff"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
brew "ansible"
# Next gen ls command https://github.com/Peltoche/lsd
brew "lsd"
brew "swi-prolog"
brew "logtalk"
brew "terraform"
brew "watch"
brew "grep"
brew "htop"
brew "moreutils"
brew "asciidoc"
brew "bash-snippets"
# Mac App Store command line interface
brew "mas"

mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Pages', id: 409201541
mas 'GarageBand', id: 682658836
mas 'Numbers', id: 409203825
