tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Tap for chezmoi
tap "twpayne/taps"
# Tap for real path
tap "iveney/mocha"

cask "java"
cask "iterm2"
cask "zoomus"
cask "visual-studio-code"
cask "pgadmin4"
cask "sloth"
cask "xmind"
cask "vlc"
cask "spectacle"
cask "firefox"
# quik for GoPro
cask "quik"
# Skitch for taking notes
cask "skitch"
# Fonts
cask "font-meslo-for-powerline"
# IntelliJ IDEA Ultimate
cask "intellij-idea"
# IntelliJ Goland Toolbox
cask "goland"
# Godot : Free 2D/3D Game Engine
cask "godot"
# Calibre for converting ebooks (epub to pdf)
cask "calibre"

# Mac app store
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Pages', id: 409201541
mas 'GarageBand', id: 682658836
mas 'Numbers', id: 409203825

brew "zsh"
brew "git-ftp"
brew "gnu-sed"
brew "hugo"
brew "inetutils"
brew "ncftp"
brew "plantuml"
brew "python3"
brew "ripgrep"
brew "twpayne/taps/chezmoi"
brew "tmux"
brew "node"
# Fasd (pronounced similar to "fast") is a command-line productivity booster. https://github.com/clvv/fasd
brew "fasd"
# Simplistic interactive filtering tool https://github.com/peco/peco
brew "peco"
# Tig is an ncurses-based text-mode interface for git.
brew "tig"
# OS X: Get Full Path of File Using Realpath
brew "realpath"
brew "mackup"
# Lynx is a fully featured World-Wide Web browser for terminal users. https://invisible-island.net/lynx/
brew "lynx"
brew "colordiff"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
brew "ansible"
# Next gen ls command https://github.com/Peltoche/lsd
brew "lsd"
brew "swi-prolog"
brew "logtalk"
brew "terraform"
brew "watch"
brew "grep"
brew "htop"
brew "moreutils"
brew "asciidoc"
brew "bash-snippets"
# Mac App Store command line interface
brew "mas"
# Using pyenv to be able to install specific python versions https://stackoverflow.com/questions/49794432/how-to-setup-a-pipenv-python-3-6-project-if-os-python-version-is-3-5
brew "pyenv"
# Google CLI https://github.com/jarun/googler
brew "googler"
# Install bat https://github.com/sharkdp/bat
brew "bat"
# https://github.com/jhspetersson/fselect
brew "fselect"
# Add surfraw https://github.com/kisom/surfraw
brew "surfraw"
# Add dict
brew "dict"
# Add prettyping
brew "prettyping"
# Install glances for monitoring
brew "glances"
# Fuzzy Finder
brew "fzf"
# Diff-so-fancy
brew "diff-so-fancy"
# add nice disk usage
brew "ncdu"
# add tldr alternative to help
brew "tldr"
# add pandoc
brew "pandoc"
# add ShellCheck
brew "shellcheck"
# add spell check
brew "aspell"
# add neofetch to nicely display system info
brew "neofetch"
# add nushell https://github.com/nushell/nushell
brew "nushell"
# tools for K8S
brew "kubectl"
brew "kubectx"
brew "packer"
