tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Tap for chezmoi
tap "twpayne/taps"
# Tap for real path
tap "iveney/mocha"
tap "atlassian/tap"
tap "datawire/blackbird" # telepresence https://www.telepresence.io/reference/install
tap "liamg/tfsec"
tap "derailed/k9s"
tap "github/gh"
tap "derailed/popeye" # provides popeye, k8s sanity analysis
tap "instrumenta/instrumenta" # provides kubeval
tap "weaveworks/tap" # provides eksctl
tap "b4b4r07/tap" # provides gomi a replacement for rm command
tap "eddieantonio/eddieantonio" # provides imgcat, cat but for images
tap "jesseduffield/lazygit" # provides lazygit, simple terminal UI for git commands
tap "jesseduffield/lazydocker" # provides lazydocker, simple terminal UI for managnig docker
tap "skanehira/docui" # provides docui, simple terminal UI for creating/configuring docker services
tap "romkatv/powerlevel10k" # provides powerlevel10k

cask "java"
cask "iterm2"
cask "zoomus"
cask "visual-studio-code"
cask "pgadmin4"
cask "sloth"
cask "xmind"
cask "firefox"
# quik for GoPro
cask "quik"
# Skitch for taking notes
cask "skitch"
# Fonts
cask "font-meslo-for-powerline"
# IntelliJ IDEA Ultimate
cask "intellij-idea"
# IntelliJ Goland Toolbox
cask "goland"
# Godot : Free 2D/3D Game Engine
cask "godot"
# Calibre for converting ebooks (epub to pdf)
cask "calibre"
# Vagrant
cask "vagrant"
# VirtualBox
cask "virtualbox"
# Arduino
cask "arduino"
cask "koa11y" # desktop app for asserting websites accessibility
cask "osxfuse" # telepresence https://www.telepresence.io/reference/install
cask "qbittorrent"
cask "vlc"

# Mac app store
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Pages', id: 409201541
mas 'GarageBand', id: 682658836
mas 'Numbers', id: 409203825

brew "zsh"
brew "git-ftp"
brew "gnu-sed"
brew "hugo"
brew "inetutils"
brew "ncftp"
brew "plantuml"
brew "python3"
brew "ripgrep"
brew "twpayne/taps/chezmoi"
brew "tmux"
brew "node"
# Fasd (pronounced similar to "fast") is a command-line productivity booster. https://github.com/clvv/fasd
brew "fasd"
# Simplistic interactive filtering tool https://github.com/peco/peco
brew "peco"
# Tig is an ncurses-based text-mode interface for git.
brew "tig"
# OS X: Get Full Path of File Using Realpath
brew "realpath"
brew "mackup"
# Lynx is a fully featured World-Wide Web browser for terminal users. https://invisible-island.net/lynx/
brew "lynx"
brew "colordiff"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
brew "ansible"
# Next gen ls command https://github.com/Peltoche/lsd
brew "lsd"
brew "swi-prolog"
brew "logtalk"
brew "terraform"
brew "watch"
brew "grep"
brew "htop"
brew "moreutils"
brew "asciidoc"
brew "bash-snippets"
# Mac App Store command line interface
brew "mas"
# Using pyenv to be able to install specific python versions https://stackoverflow.com/questions/49794432/how-to-setup-a-pipenv-python-3-6-project-if-os-python-version-is-3-5
brew "pyenv"
# Google CLI https://github.com/jarun/googler
brew "googler"
# Install bat https://github.com/sharkdp/bat
brew "bat"
# https://github.com/jhspetersson/fselect
brew "fselect"
# Add surfraw https://github.com/kisom/surfraw
brew "surfraw"
# Add dict
brew "dict"
# Add prettyping
brew "prettyping"
# Install glances for monitoring
brew "glances"
# Fuzzy Finder
brew "fzf"
# Diff-so-fancy
brew "diff-so-fancy"
# add nice disk usage
brew "ncdu"
# add tldr alternative to help
brew "tldr"
# add pandoc
brew "pandoc"
# add ShellCheck
brew "shellcheck"
# add spell check
brew "aspell"
# add neofetch to nicely display system info
brew "neofetch"
# add nushell https://github.com/nushell/nushell
brew "nushell"

# tools for K8S
brew "kubectl"
brew "kubectx"

brew "packer"
brew "go"
brew "weechat" # need an IRC client
brew "tflint" # terraform linter
brew "ktlint" # kotlin linter
brew "cmake" # compiler, was needed for compiling YouCompleteMe, see https://github.com/ycm-core/YouCompleteMe
brew "zola" # a simple and fast static site generator
brew "rustup" # Install Rust
brew "jq" # add jq utility for parsing json
brew "octant" # k8s cluster viewer
brew "telepresence" # telepresence https://www.telepresence.io/reference/install
brew "ansiweather" # https://github.com/fcambus/ansiweather
brew "bats" # test for bash scripts
brew "atlassian-plugin-sdk" # atlassian sdk https://developer.atlassian.com/server/framework/atlassian-sdk/install-the-atlassian-sdk-on-a-linux-or-mac-system/#step-2-download-and-install-the-sdk
brew "terragrunt"
brew "helm"
brew "aws-iam-authenticator"
brew "tfsec"
brew "k9s"
brew "stern"
brew "tac" # Needed for some terraform modules at work
brew "coreutils"
brew "gh" # GitHub CLI
brew "bash" # time to upgrade bash
brew "popeye" # Kubernetes resources sanity analysis
brew "pre-commit" # https://pre-commit.com/#install
brew "terraform-docs" # https://github.com/segmentio/terraform-docs
brew "shfmt" # format shell
brew "dive" # a tool to explore docker layers
brew "terraform_landscape" # pretty print of terraform plan output
brew "kubeval" # linter for kubernetes config files
brew "eksctl"
brew "gomi" # replacement for rm command
brew "imgcat" # cat for images
brew "lazygit" # simple terminal UI for git commands
brew "lazydocker" # simple terminal UI for managing docker
brew "docui" # simple terminal UI for creating/configuring docker services
brew "httpie" # provides http - a command line HTTP client that will make you smile.
brew "hyperfine" # CLI benchmark tool
brew "powerlevel10k"

